{
  "ChargeCalculationDescriptor": {
    "description": "Calculation of a service charge or fee.",
    "DatePeriod": {
      "properties": {
        "fromDateTime": {
          "description": "Date and time at which the period starts.",
          "DateAndTime": {
            "example": "2022-04-17T08:00:00Z"
          }
        },
        "upToDateTime": {
          "description": "Date and time at which the period ends.",
          "DateAndTime": {
            "example": "2022-04-17T08:00:00Z"
          }
        }
      }
    },
    "properties": {
      "name": {
        "ChargeName": {
          "description": "Name of the charge calculation in PascalCase. Possible values: Fee, Overdraft, CardLatePayment, CashAdvance, LatePayment, CashWithdrawal, EarlyWithdrawal, Dormant, EIM, ATM, BillPayment, FDIC, Overdraft, OverdraftInterest, OverdraftCourtesy. Service Charge values: AutomaticActivityCharge, MaintenanceActivityCharge, MaintenanceServiceCharge. ServiceCharge, ServiceChargeCreditBack. Also other external codes to identify the charge. \n",
          "example": "CardLatePayment"
        }
      },
      "amount": {
        "description": "Amount charged for the service.",
        "PositiveAmount": {
          "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: 0\n",
          "example": "100"
        }
      },
      "rate": {
        "description": "Rate applied on a basis amount to calculate the service charge.\n",
        "Percentage": {
          "description": "Value expressed as a positive or negarive percentage, rate expressed as a percentage, that is, in hundredths, for example, 0.7 is 7/10 of a percent, and 7.0 is 7%.\n    total number of digits: 11\n    number of digits in fractional part: 10\n    Max Value: 100\n",
          "example": "25"
        }
      },
      "chargeType": {
        "ChargeType": {
          "description": "Type of service for which a charge is asked or paid. Some possible ISO 20022 compliant values are:\n    BrokerageFee, Commission, BackEndLoad, FrontEndLoad, Switch, DilutionLevy, Discount, ManagementFee, TransferFee, MatchingFees, PostageCharge, RegulatoryFee, ShippingCharge, ServiceProvisionFee, SpecialConcessions, PartAcquis, Penalty, ContingencyDeferredSalesCharge, Equalisation, CorrespondentBankCharge, Premium, Initial, AdvisoryFee, CustodyFee, PublicationFee, AccountingFee, SignatureService, StorageAtDestination, StorageAtOrigin, Packaging, PickUp, DangerousGoodsFee, SecurityCharge, InsurancePremium, CollectFreight, ClearanceAndHandlingAtOrigin, ClearanceAndHandlingAtDestination, AirWayBillFee, TransportCharges, UCITSCommission, SpeciallyAgreedFrontEndLoad, ADRFee, IssuanceCancellationFee, MiscellaneousFee, IssuanceFee, Fee, Insurance, NonTaxable, Recurring, Taxable.\n    \n    \n",
          "example": "ManagementFee"
        }
      },
      "exemptIndicator": {
        "description": "Indicates whether the account is exempt of the charge.\n"
      }
    }
  }
}