{
  "ChargeCalculation": {
    "description": "Calculation of a service charge or fee.",
    "DatePeriod": {
      "properties": {
        "fromDateTime": {
          "description": "Date and time at which the period starts.",
          "DateAndTime": {
            "example": "2022-04-17T08:00:00Z"
          }
        },
        "upToDateTime": {
          "description": "Date and time at which the period ends.",
          "DateAndTime": {
            "example": "2022-04-17T08:00:00Z"
          }
        }
      }
    },
    "properties": {
      "chargeId": {
        "description": "Unique identifier of charge. \n",
        "Id": {
          "example": "5fb9d4d6-1a3c-11ed-861d-0242ac120002"
        }
      },
      "name": {
        "ChargeName": {
          "description": "Name of the charge calculation in PascalCase. Possible values: Fee, Overdraft, CardLatePayment, CashAdvance, LatePayment, CashWithdrawal, EarlyWithdrawal, Dormant, EIM, ATM, BillPayment, FDIC, Overdraft, OverdraftInterest, OverdraftCourtesy. Service Charge values: AutomaticActivityCharge, MaintenanceActivityCharge, MaintenanceServiceCharge. ServiceCharge, ServiceChargeCreditBack. Also other external codes to identify the charge. \n",
          "example": "CardLatePayment"
        }
      },
      "status": {
        "ChargeStatus": {
          "description": "Specifies the current status of the charge. \n       Possible values are: Charged, Waived, AnalysisAddenda, AddendaCharged, AddendaChargedOnCycleDay.\n",
          "example": "Charged"
        }
      },
      "amount": {
        "description": "Amount charged for the service.",
        "PositiveAmount": {
          "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: 0\n",
          "example": "100"
        }
      },
      "currency": {
        "description": "Charge currency\n",
        "CurrencyCode": {
          "description": "Three contiguous letters for the representation of currencies and funds. Valid currency codes are registered with the ISO 4217 Maintenance Agency. \n",
          "example": "USD"
        }
      },
      "rate": {
        "description": "Rate applied on a basis amount to calculate the service charge.\n",
        "Percentage": {
          "description": "Value expressed as a positive or negarive percentage, rate expressed as a percentage, that is, in hundredths, for example, 0.7 is 7/10 of a percent, and 7.0 is 7%.\n    total number of digits: 11\n    number of digits in fractional part: 10\n    Max Value: 100\n",
          "example": "25"
        }
      },
      "chargeType": {
        "ChargeType": {
          "description": "Type of service for which a charge is asked or paid. Some possible ISO 20022 compliant values are:\n    BrokerageFee, Commission, BackEndLoad, FrontEndLoad, Switch, DilutionLevy, Discount, ManagementFee, TransferFee, MatchingFees, PostageCharge, RegulatoryFee, ShippingCharge, ServiceProvisionFee, SpecialConcessions, PartAcquis, Penalty, ContingencyDeferredSalesCharge, Equalisation, CorrespondentBankCharge, Premium, Initial, AdvisoryFee, CustodyFee, PublicationFee, AccountingFee, SignatureService, StorageAtDestination, StorageAtOrigin, Packaging, PickUp, DangerousGoodsFee, SecurityCharge, InsurancePremium, CollectFreight, ClearanceAndHandlingAtOrigin, ClearanceAndHandlingAtDestination, AirWayBillFee, TransportCharges, UCITSCommission, SpeciallyAgreedFrontEndLoad, ADRFee, IssuanceCancellationFee, MiscellaneousFee, IssuanceFee, Fee, Insurance, NonTaxable, Recurring, Taxable.\n    \n    \n",
          "example": "ManagementFee"
        }
      },
      "exemptIndicator": {
        "description": "Indicates whether the account is exempt of the charge.\n"
      },
      "exemptPeriodsNumber": {
        "description": "Indicates the number of charge periods that the account is exempt from charges.\n"
      },
      "codes": {
        "description": "Additional charge codes. Possible values: CalculationCodeNumber, ServiceChargePrefix, ServiceChargeCode.\n",
        "items": {
          "GenericCode": {
            "required": [
              "name",
              "value"
            ],
            "properties": {
              "name": {
                "description": "Name of the code in PascalCase.\n",
                "example": "AccountingGroup"
              },
              "value": {
                "description": "Code value.",
                "example": "195"
              },
              "description": {
                "Title": {
                  "example": "This is a Title."
                }
              }
            },
            "description": "Generic code definition."
          }
        }
      },
      "calculationMethodCode": {
        "description": "Servicer charge calculation code. Possible values: FIFO, older payment past due. LIFO, most recent payment past due. Also could be a Bank defined string. \n"
      },
      "calculationMethodOptions": {
        "description": "Indicates other calculation method options for charge calculation.\n",
        "items": {
          "ChargeCalculationMethodOption": {
            "description": "Possible Values: Default, ScheduledBalance, 365Days, 12DaysInPeriod, OmitCurrentInterest, 12DaysInPeriod, IncludeInterestDueDate, CurrentBalance, 360Days,  RuleOf78, AddOn, \nPercentageByPrincipalAndInterest: Indicates the late charge percent is multiplied by the principal and interest of the payment past due and compared with the Minimum Amount and/or Maximum Amount. If a minimum and maximum are not defined, the calculated amount is charged. If a minimum is defined with no maximum, the greater of either the calculated amount or the minimum amount is charged. If a maximum is defined with no minimum, the lesser of either the calculated amount or the maximum amount is charged. If both a minimum and maximum are defined, the calculated amount is charged if it falls between the minimum and maximum amounts. If the calculated amount is less than the minimum, the minimum amount is charged. If the calculated amount is greater than the maximum, the maximum amount is charged, PercentageByEscrow: Indicates the late charge percent is multiplied by the escrow of the payment past due to calculate the late charge, PrincipalDividedByFrequency : The late charge percentage is divided by the payment frequency, then multiplied by the outstanding principal balance and the result is the late charge.\n  PercentageByOutstandingPrincipal: The late charge percentage is multiplied by the outstanding principal balance and the result is the late charge.\n"
          }
        }
      },
      "options": {
        "items": {
          "ChargeOptions": {
            "description": "Specifies charge options for NSF and Notices in PascalCase. Possible values names are: NSFDefault, NSFRemainPosted, PostedNonNSFDisregarded, NSFPaid, NonPostedNSFReturned, PostedNSFReturned, NonPostedNSFPaid, OneNotice, PrintCurrentBalance, SeparateNotices, NoNoticeForChargeBacks. ExemptNSFFees, ExemptNegativeBalanceFees, ExemptExcessDebitFees.\n",
            "example": "NSFDefault"
          }
        }
      },
      "calculationBasis": {
        "CalculationBasis": {
          "description": "Specifies the calculation basis of a charge or fee. Some possible ISO 20022 compliant values are:\n    Average, Daily, Monthly, Annual, FullTerm, RemainingTerm, Monthly78th\n\n    \n    \n    \n",
          "example": "Monthly"
        }
      },
      "bearerType": {
        "ChargeBearerType": {
          "description": "Specifies which party(ies) will pay charges due for processing of the instruction.\nBorneByDebtor, BorneByCreditor,  Shared, FollowingServiceLevel\n",
          "example": "Shared"
        }
      },
      "maximumAmount": {
        "description": "Maximum amount of money asked or paid for the charge.\n",
        "PositiveAmount": {
          "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: 0\n",
          "example": "100"
        }
      },
      "maximumNumber": {
        "description": "Maximum Number of charges.\n"
      },
      "minimumAmount": {
        "description": "Minimum amount of money asked or paid for the charge.\n",
        "PositiveAmount": {
          "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: 0\n",
          "example": "100"
        }
      },
      "enableIndicator": {
        "description": "Indicates whether the charge is enabled for automatic charge.\n",
        "example": true
      },
      "relatedInterest": {
        "InterestCalculationDescriptor": {
          "properties": {
            "name": {
              "InterestName": {
                "description": "Name in PascalCase of the interest that applies to the account. For instance, Deposit. Also identifications of the interest or charge.\n",
                "example": "Deposit"
              }
            },
            "code": {
              "description": "Interest code used by the account servicer.\n"
            },
            "enableIndicator": {
              "description": "Indicates whether the interest is enabled for automatic charge.\n",
              "example": true
            },
            "dayCountBasis": {
              "InterestDayCountBasis": {
                "description": "An interest day count basis is a method used to calculate interest accrual over a period of time for loans and bonds. The method involves determining the number of days over which interest is being calculated, known as the accrual period. The resulting accrual period is then divided by a certain number to calculate the daily interest rate, which is applied to the principal balance to determine the interest payment. Possible Values: ActualActual, Actual360, Actual365, 365365, 360360, Monthly78ths, 365360, ActualSchedule, ScheduleSchedule.\n",
                "example": "Actual360"
              }
            },
            "calculationMethodOption": {
              "InterestComputationParameter": {
                "description": "Specifies a parameter that apply at the interest day count basis. Possible Values:  LastInterest,  EqualPayment, InterestAndPrincipal, InterestSeparatedm, Amortized, AddOn, NegativeAmortization, Simple, FHLMC. \n",
                "example": "LastInterest"
              }
            },
            "nextInterestDate": {
              "Date": {
                "description": "A particular point in the progression of time in a calendar year expressed in the YYYY-MM-DD format.",
                "example": "2022-04-17"
              }
            },
            "term": {
              "description": "The period funds are earning interest.",
              "TemporalDuration": {
                "required": [
                  "unit"
                ],
                "properties": {
                  "unit": {
                    "description": "Unit that describes the duration.",
                    "TemporalUnit": {
                      "description": "Specifies a temporal unit. Possible values are: Days, Months, Weeks, Years.\n",
                      "example": "Months"
                    }
                  },
                  "value": {
                    "maximum": 999,
                    "description": "Value of the duration in number of units."
                  }
                },
                "description": "Describes a temporal duration.\n"
              }
            },
            "calculationFrequency": {
              "Frequency": {
                "description": "Specifies an event frequency",
                "DatePeriod": {
                  "properties": {
                    "fromDateTime": {
                      "description": "Date and time at which the period starts.",
                      "DateAndTime": {
                        "example": "2022-04-17T08:00:00Z"
                      }
                    },
                    "upToDateTime": {
                      "description": "Date and time at which the period ends.",
                      "DateAndTime": {
                        "example": "2022-04-17T08:00:00Z"
                      }
                    }
                  }
                },
                "properties": {
                  "cycleType": {
                    "description": "Specifies a cycle type. Possible values: Temporal, AtMaturity, InterestCycle, FromLastStatement, LastDay, AutoPay.\n"
                  },
                  "cycle": {
                    "description": "Specifies a temporal cycle. Possible values:  Annual, Monthly, Quarterly, SemiAnnual, Weekly, Daily, Once, IntraDay, Overnight, TenDays, Fortnightly, TriggeredByMovement, Never, Rate, OnCreditEvent, Upfront, OnExpiry, Hourly, TriAnnual, Bimonthly, OnDemand, Shift, TwiceAWeek, XDays, XWeeks, XMonths, XYears, XQuaters, XSemiYears, XTwoWeeks\n",
                    "example": "Monthly"
                  },
                  "every": {
                    "maximum": 999,
                    "description": "Custom cycle definition. Number of XDays, XWeeks, XMonths, XYears. \n",
                    "example": 15
                  },
                  "weekDay": {
                    "description": "Day of the week. Possible Values: Monday, Tuesday, Wednesday, Thursday, Friday.\n",
                    "example": "Tuesday"
                  },
                  "weekNumbers": {
                    "items": {
                      "description": "Number to select one week day of a Month. Possible Values: 1st, 2nd, 3th, 4th, 5th\n",
                      "example": "1st"
                    }
                  },
                  "days": {
                    "items": {
                      "description": "Day of the Month\n",
                      "Day": {
                        "maximum": 31,
                        "description": "Specifies the date in a month.",
                        "example": 30
                      }
                    }
                  },
                  "months": {
                    "items": {
                      "description": "Month of the Year within an Annual cycle.\n",
                      "Month": {
                        "description": "Specifies a month number.",
                        "example": "12"
                      }
                    }
                  },
                  "startDay": {
                    "MonthDay": {
                      "description": "A particular point in the year expressed in the MM-DD format.",
                      "example": "04-17"
                    }
                  },
                  "numberOfTimes": {
                    "description": "Number of times the event will be repeated.\n",
                    "example": 4
                  }
                }
              }
            },
            "balances": {
              "description": "Total amounts related to an interest",
              "items": {
                "Balance": {
                  "required": [
                    "balanceName"
                  ],
                  "description": "Numerical representation of the net increases and decreases in an account at a specific point in time.\n",
                  "Period": {
                    "DatePeriod": {
                      "properties": {
                        "fromDateTime": {
                          "description": "Date and time at which the period starts.",
                          "DateAndTime": {
                            "example": "2022-04-17T08:00:00Z"
                          }
                        },
                        "upToDateTime": {
                          "description": "Date and time at which the period ends.",
                          "DateAndTime": {
                            "example": "2022-04-17T08:00:00Z"
                          }
                        }
                      }
                    },
                    "properties": {
                      "periodNumber": {
                        "description": "Sequence number of the period."
                      },
                      "periodName": {
                        "PeriodName": {
                          "description": "Time of the year or previous. Possible Values: YearToDate, MonthToDate, PreviousYear, BeginningPreviousYear, QuarterToDate, PreviousQuarter, YearEnd\n"
                        }
                      }
                    }
                  },
                  "properties": {
                    "balanceName": {
                      "BalanceName": {
                        "description": "Specifies the nature of the balance. Possible values: Current, Available, Pending, Opening, Blocked, Previous, RelatedBalance, OnHold, PendingLedger, Collected, LastAnniversary, Accrued, CurrentAccrued, PreviousAccrued, CurrentWithLastCalculus, CarriedAdjustment, PaidWithPenalties, Accrued, Penalty, CollectionLedger, LastLedger, CurrentLedger, Ledger, MinimumAvailable, MinimumLedger, Withheld, CurrentBooked, CurrentBook, LastDeposit, FloatAmount, Average, RegulationDDAvailable. Loan Balances: CashProceeds, the amount that a customer actually received, exclusive of insurance premiums, fees, and unearned discount; FinancedExpenses, indicates the amount of expenses an institution has financed for a borrower;  TotalInterest; AdditionalInterest, if the date of the first payment is beyond one month from the note date, the interest for the odd days will be earned during the first interest period; DeferredUnsecuredPrincipal, is the outstanding balance of an unsecured debt. The DUPB includes any accrued interest that is yet to be paid by the borrower. The deferral typically occurs due to bankruptcy or debt relief proceedings, which temporarily halt collection efforts by the original creditor; Charge Balances: Earned, RealTimeDeliveryMaximum, Current, Financed, Prepaid, CurrentEarned, CurrentEarnedOtherEscrow, InterestPaidToDate, InterestPaidThisYear, InterestPaidPreviousYear, InterestPaidLastStatement, InterestPaidThisYear, RevolvingCreditPaid, BasePaidToDate, TotalPastDue, Escrow, OtherEscrow, FinalAmount, FinalInterestAmount, Chapter4PreviousYear, Payments: Delinquent, FixPayment, Transaction, LoanPayOff\n",
                        "example": "Available"
                      }
                    },
                    "amount": {
                      "Amount": {
                        "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: -9999999999999.99999999\n",
                        "example": "100"
                      }
                    },
                    "count": {
                      "description": "Number of transactions added to the amount.\n"
                    },
                    "currency": {
                      "CurrencyCode": {
                        "description": "Three contiguous letters for the representation of currencies and funds. Valid currency codes are registered with the ISO 4217 Maintenance Agency. \n",
                        "example": "USD"
                      }
                    },
                    "calculationDate": {
                      "description": "Specifies the date and time at which the balance is calculated.",
                      "DateAndTime": {
                        "example": "2022-04-17T08:00:00Z"
                      }
                    },
                    "codes": {
                      "description": "Bank defined codes to clasify balances. Possible values: BalanceCategory, BalanceType, PartyAgreementNumber.\n",
                      "items": {
                        "GenericCode": {
                          "required": [
                            "name",
                            "value"
                          ],
                          "properties": {
                            "name": {
                              "description": "Name of the code in PascalCase.\n",
                              "example": "AccountingGroup"
                            },
                            "value": {
                              "description": "Code value.",
                              "example": "195"
                            },
                            "description": {
                              "Title": {
                                "example": "This is a Title."
                              }
                            }
                          },
                          "description": "Generic code definition."
                        }
                      }
                    }
                  }
                }
              }
            }
          },
          "description": "Set of parameters used to calculate an interest.\n",
          "InterestCalculationRate": {
            "properties": {
              "rateName": {
                "RateName": {
                  "description": "Specifies the name of the rate. Possible values: Prior, Original, Actual, LastAnniversary, Effective, Current, Future, Base, Floor, Ceiling, OverSplit, UnderSplit.\n",
                  "example": "Actual"
                }
              },
              "rateTierName": {
                "RateName": {
                  "description": "Specifies the name of the rate. Possible values: Prior, Original, Actual, LastAnniversary, Effective, Current, Future, Base, Floor, Ceiling, OverSplit, UnderSplit.\n",
                  "example": "Actual"
                }
              },
              "percentage": {
                "Percentage": {
                  "description": "Value expressed as a positive or negarive percentage, rate expressed as a percentage, that is, in hundredths, for example, 0.7 is 7/10 of a percent, and 7.0 is 7%.\n    total number of digits: 11\n    number of digits in fractional part: 10\n    Max Value: 100\n",
                  "example": "25"
                }
              },
              "amount": {
                "description": "Maximum amount range\n",
                "PositiveAmount": {
                  "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: 0\n",
                  "example": "100"
                }
              },
              "currency": {
                "CurrencyCode": {
                  "description": "Three contiguous letters for the representation of currencies and funds. Valid currency codes are registered with the ISO 4217 Maintenance Agency. \n",
                  "example": "USD"
                }
              }
            },
            "description": "Rate attributes \n"
          }
        }
      },
      "debitIndicator": {
        "description": "Indicates whether the charge is automatically debited from the defined account.\n"
      },
      "payments": {
        "description": "Payments methods to waive o to pay back the charge.\n",
        "items": {
          "AccountChargePayment": {
            "properties": {
              "frequency": {
                "description": "Indicates the schedule for paying to accounts.\n",
                "Frequency": {
                  "description": "Specifies an event frequency",
                  "DatePeriod": {
                    "properties": {
                      "fromDateTime": {
                        "description": "Date and time at which the period starts.",
                        "DateAndTime": {
                          "example": "2022-04-17T08:00:00Z"
                        }
                      },
                      "upToDateTime": {
                        "description": "Date and time at which the period ends.",
                        "DateAndTime": {
                          "example": "2022-04-17T08:00:00Z"
                        }
                      }
                    }
                  },
                  "properties": {
                    "cycleType": {
                      "description": "Specifies a cycle type. Possible values: Temporal, AtMaturity, InterestCycle, FromLastStatement, LastDay, AutoPay.\n"
                    },
                    "cycle": {
                      "description": "Specifies a temporal cycle. Possible values:  Annual, Monthly, Quarterly, SemiAnnual, Weekly, Daily, Once, IntraDay, Overnight, TenDays, Fortnightly, TriggeredByMovement, Never, Rate, OnCreditEvent, Upfront, OnExpiry, Hourly, TriAnnual, Bimonthly, OnDemand, Shift, TwiceAWeek, XDays, XWeeks, XMonths, XYears, XQuaters, XSemiYears, XTwoWeeks\n",
                      "example": "Monthly"
                    },
                    "every": {
                      "maximum": 999,
                      "description": "Custom cycle definition. Number of XDays, XWeeks, XMonths, XYears. \n",
                      "example": 15
                    },
                    "weekDay": {
                      "description": "Day of the week. Possible Values: Monday, Tuesday, Wednesday, Thursday, Friday.\n",
                      "example": "Tuesday"
                    },
                    "weekNumbers": {
                      "items": {
                        "description": "Number to select one week day of a Month. Possible Values: 1st, 2nd, 3th, 4th, 5th\n",
                        "example": "1st"
                      }
                    },
                    "days": {
                      "items": {
                        "description": "Day of the Month\n",
                        "Day": {
                          "maximum": 31,
                          "description": "Specifies the date in a month.",
                          "example": 30
                        }
                      }
                    },
                    "months": {
                      "items": {
                        "description": "Month of the Year within an Annual cycle.\n",
                        "Month": {
                          "description": "Specifies a month number.",
                          "example": "12"
                        }
                      }
                    },
                    "startDay": {
                      "MonthDay": {
                        "description": "A particular point in the year expressed in the MM-DD format.",
                        "example": "04-17"
                      }
                    },
                    "numberOfTimes": {
                      "description": "Number of times the event will be repeated.\n",
                      "example": 4
                    }
                  }
                }
              },
              "paymentType": {
                "AccountPaymentMethodType": {
                  "description": "Specifies the type of interest payment. Possible values are: Compound, Checking, Savings, Check, Capitalize, TransferToAccount, CertificateOfDeposit, Deposit, DepositLoan, Loan.\n",
                  "example": "Compound"
                }
              },
              "paymentTypeOptions": {
                "items": {
                  "description": "Options on the payment method or account identifier. Possible values: AllPrimary, Primary, Secondary\n",
                  "example": "Primary"
                }
              },
              "paymentName": {
                "description": "Human readable pascal case identifier of the payment concept. Possible values: CreditBack, Interest.\n"
              },
              "accountId": {
                "description": "The account id that receives interest credits.\n",
                "AccountId": {
                  "description": "Identification assigned by the account service institution (Servicer). Could be encoded (UUID). Also may be used as composite account identifier when overlaying the account code parts. <branch-type-subtype-number>   \n\n   \n",
                  "example": "033-DDA-123456"
                }
              },
              "referenceNumber": {
                "description": "The reference number of the interest pay to the account.\n",
                "Id": {
                  "example": "5fb9d4d6-1a3c-11ed-861d-0242ac120002"
                }
              },
              "paymentDate": {
                "description": "Last payment date\n",
                "Date": {
                  "description": "A particular point in the progression of time in a calendar year expressed in the YYYY-MM-DD format.",
                  "example": "2022-04-17"
                }
              },
              "lastPaid": {
                "PositiveAmount": {
                  "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: 0\n",
                  "example": "100"
                }
              },
              "codes": {
                "description": "Additional payment codes. Posible values: PaymentCalculus, specifies how the credit back portion of an automatic service charge is calculated. PaymentReference, additional payment reference to link with other parts of the system.\n",
                "items": {
                  "GenericCode": {
                    "required": [
                      "name",
                      "value"
                    ],
                    "properties": {
                      "name": {
                        "description": "Name of the code in PascalCase.\n",
                        "example": "AccountingGroup"
                      },
                      "value": {
                        "description": "Code value.",
                        "example": "195"
                      },
                      "description": {
                        "Title": {
                          "example": "This is a Title."
                        }
                      }
                    },
                    "description": "Generic code definition."
                  }
                }
              }
            },
            "description": "Set of attributes related to the account payment. \n"
          }
        }
      },
      "periodicity": {
        "Frequency": {
          "description": "Specifies an event frequency",
          "DatePeriod": {
            "properties": {
              "fromDateTime": {
                "description": "Date and time at which the period starts.",
                "DateAndTime": {
                  "example": "2022-04-17T08:00:00Z"
                }
              },
              "upToDateTime": {
                "description": "Date and time at which the period ends.",
                "DateAndTime": {
                  "example": "2022-04-17T08:00:00Z"
                }
              }
            }
          },
          "properties": {
            "cycleType": {
              "description": "Specifies a cycle type. Possible values: Temporal, AtMaturity, InterestCycle, FromLastStatement, LastDay, AutoPay.\n"
            },
            "cycle": {
              "description": "Specifies a temporal cycle. Possible values:  Annual, Monthly, Quarterly, SemiAnnual, Weekly, Daily, Once, IntraDay, Overnight, TenDays, Fortnightly, TriggeredByMovement, Never, Rate, OnCreditEvent, Upfront, OnExpiry, Hourly, TriAnnual, Bimonthly, OnDemand, Shift, TwiceAWeek, XDays, XWeeks, XMonths, XYears, XQuaters, XSemiYears, XTwoWeeks\n",
              "example": "Monthly"
            },
            "every": {
              "maximum": 999,
              "description": "Custom cycle definition. Number of XDays, XWeeks, XMonths, XYears. \n",
              "example": 15
            },
            "weekDay": {
              "description": "Day of the week. Possible Values: Monday, Tuesday, Wednesday, Thursday, Friday.\n",
              "example": "Tuesday"
            },
            "weekNumbers": {
              "items": {
                "description": "Number to select one week day of a Month. Possible Values: 1st, 2nd, 3th, 4th, 5th\n",
                "example": "1st"
              }
            },
            "days": {
              "items": {
                "description": "Day of the Month\n",
                "Day": {
                  "maximum": 31,
                  "description": "Specifies the date in a month.",
                  "example": 30
                }
              }
            },
            "months": {
              "items": {
                "description": "Month of the Year within an Annual cycle.\n",
                "Month": {
                  "description": "Specifies a month number.",
                  "example": "12"
                }
              }
            },
            "startDay": {
              "MonthDay": {
                "description": "A particular point in the year expressed in the MM-DD format.",
                "example": "04-17"
              }
            },
            "numberOfTimes": {
              "description": "Number of times the event will be repeated.\n",
              "example": 4
            }
          }
        }
      },
      "balances": {
        "items": {
          "Balance": {
            "required": [
              "balanceName"
            ],
            "description": "Numerical representation of the net increases and decreases in an account at a specific point in time.\n",
            "Period": {
              "DatePeriod": {
                "properties": {
                  "fromDateTime": {
                    "description": "Date and time at which the period starts.",
                    "DateAndTime": {
                      "example": "2022-04-17T08:00:00Z"
                    }
                  },
                  "upToDateTime": {
                    "description": "Date and time at which the period ends.",
                    "DateAndTime": {
                      "example": "2022-04-17T08:00:00Z"
                    }
                  }
                }
              },
              "properties": {
                "periodNumber": {
                  "description": "Sequence number of the period."
                },
                "periodName": {
                  "PeriodName": {
                    "description": "Time of the year or previous. Possible Values: YearToDate, MonthToDate, PreviousYear, BeginningPreviousYear, QuarterToDate, PreviousQuarter, YearEnd\n"
                  }
                }
              }
            },
            "properties": {
              "balanceName": {
                "BalanceName": {
                  "description": "Specifies the nature of the balance. Possible values: Current, Available, Pending, Opening, Blocked, Previous, RelatedBalance, OnHold, PendingLedger, Collected, LastAnniversary, Accrued, CurrentAccrued, PreviousAccrued, CurrentWithLastCalculus, CarriedAdjustment, PaidWithPenalties, Accrued, Penalty, CollectionLedger, LastLedger, CurrentLedger, Ledger, MinimumAvailable, MinimumLedger, Withheld, CurrentBooked, CurrentBook, LastDeposit, FloatAmount, Average, RegulationDDAvailable. Loan Balances: CashProceeds, the amount that a customer actually received, exclusive of insurance premiums, fees, and unearned discount; FinancedExpenses, indicates the amount of expenses an institution has financed for a borrower;  TotalInterest; AdditionalInterest, if the date of the first payment is beyond one month from the note date, the interest for the odd days will be earned during the first interest period; DeferredUnsecuredPrincipal, is the outstanding balance of an unsecured debt. The DUPB includes any accrued interest that is yet to be paid by the borrower. The deferral typically occurs due to bankruptcy or debt relief proceedings, which temporarily halt collection efforts by the original creditor; Charge Balances: Earned, RealTimeDeliveryMaximum, Current, Financed, Prepaid, CurrentEarned, CurrentEarnedOtherEscrow, InterestPaidToDate, InterestPaidThisYear, InterestPaidPreviousYear, InterestPaidLastStatement, InterestPaidThisYear, RevolvingCreditPaid, BasePaidToDate, TotalPastDue, Escrow, OtherEscrow, FinalAmount, FinalInterestAmount, Chapter4PreviousYear, Payments: Delinquent, FixPayment, Transaction, LoanPayOff\n",
                  "example": "Available"
                }
              },
              "amount": {
                "Amount": {
                  "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: -9999999999999.99999999\n",
                  "example": "100"
                }
              },
              "count": {
                "description": "Number of transactions added to the amount.\n"
              },
              "currency": {
                "CurrencyCode": {
                  "description": "Three contiguous letters for the representation of currencies and funds. Valid currency codes are registered with the ISO 4217 Maintenance Agency. \n",
                  "example": "USD"
                }
              },
              "calculationDate": {
                "description": "Specifies the date and time at which the balance is calculated.",
                "DateAndTime": {
                  "example": "2022-04-17T08:00:00Z"
                }
              },
              "codes": {
                "description": "Bank defined codes to clasify balances. Possible values: BalanceCategory, BalanceType, PartyAgreementNumber.\n",
                "items": {
                  "GenericCode": {
                    "required": [
                      "name",
                      "value"
                    ],
                    "properties": {
                      "name": {
                        "description": "Name of the code in PascalCase.\n",
                        "example": "AccountingGroup"
                      },
                      "value": {
                        "description": "Code value.",
                        "example": "195"
                      },
                      "description": {
                        "Title": {
                          "example": "This is a Title."
                        }
                      }
                    },
                    "description": "Generic code definition."
                  }
                }
              }
            }
          }
        }
      },
      "description": {
        "Description": {
          "example": "This is a description."
        }
      }
    }
  }
}