{
  "InterestCycle": {
    "properties": {
      "firstDateRate": {
        "Percentage": {
          "description": "Value expressed as a positive or negarive percentage, rate expressed as a percentage, that is, in hundredths, for example, 0.7 is 7/10 of a percent, and 7.0 is 7%.\n    total number of digits: 11\n    number of digits in fractional part: 10\n    Max Value: 100\n",
          "example": "25"
        }
      },
      "daysProcessed": {
        "description": "The number of calendar days processed during the current interest cycle.\n"
      },
      "totalDays": {
        "description": "The total number of days into the current interest period.\n"
      },
      "balances": {
        "description": "Total amounts related to an interest cycle.",
        "items": {
          "Balance": {
            "required": [
              "balanceName"
            ],
            "description": "Numerical representation of the net increases and decreases in an account at a specific point in time.\n",
            "Period": {
              "DatePeriod": {
                "properties": {
                  "fromDateTime": {
                    "description": "Date and time at which the period starts.",
                    "DateAndTime": {
                      "example": "2022-04-17T08:00:00Z"
                    }
                  },
                  "upToDateTime": {
                    "description": "Date and time at which the period ends.",
                    "DateAndTime": {
                      "example": "2022-04-17T08:00:00Z"
                    }
                  }
                }
              },
              "properties": {
                "periodNumber": {
                  "description": "Sequence number of the period."
                },
                "periodName": {
                  "PeriodName": {
                    "description": "Time of the year or previous. Possible Values: YearToDate, MonthToDate, PreviousYear, BeginningPreviousYear, QuarterToDate, PreviousQuarter, YearEnd\n"
                  }
                }
              }
            },
            "properties": {
              "balanceName": {
                "BalanceName": {
                  "description": "Specifies the nature of the balance. Possible values: Current, Available, Pending, Opening, Blocked, Previous, RelatedBalance, OnHold, PendingLedger, Collected, LastAnniversary, Accrued, CurrentAccrued, PreviousAccrued, CurrentWithLastCalculus, CarriedAdjustment, PaidWithPenalties, Accrued, Penalty, CollectionLedger, LastLedger, CurrentLedger, Ledger, MinimumAvailable, MinimumLedger, Withheld, CurrentBooked, CurrentBook, LastDeposit, FloatAmount, Average, RegulationDDAvailable. Loan Balances: CashProceeds, the amount that a customer actually received, exclusive of insurance premiums, fees, and unearned discount; FinancedExpenses, indicates the amount of expenses an institution has financed for a borrower;  TotalInterest; AdditionalInterest, if the date of the first payment is beyond one month from the note date, the interest for the odd days will be earned during the first interest period; DeferredUnsecuredPrincipal, is the outstanding balance of an unsecured debt. The DUPB includes any accrued interest that is yet to be paid by the borrower. The deferral typically occurs due to bankruptcy or debt relief proceedings, which temporarily halt collection efforts by the original creditor; Charge Balances: Earned, RealTimeDeliveryMaximum, Current, Financed, Prepaid, CurrentEarned, CurrentEarnedOtherEscrow, InterestPaidToDate, InterestPaidThisYear, InterestPaidPreviousYear, InterestPaidLastStatement, InterestPaidThisYear, RevolvingCreditPaid, BasePaidToDate, TotalPastDue, Escrow, OtherEscrow, FinalAmount, FinalInterestAmount, Chapter4PreviousYear, Payments: Delinquent, FixPayment, Transaction, LoanPayOff\n",
                  "example": "Available"
                }
              },
              "amount": {
                "Amount": {
                  "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: -9999999999999.99999999\n",
                  "example": "100"
                }
              },
              "count": {
                "description": "Number of transactions added to the amount.\n"
              },
              "currency": {
                "CurrencyCode": {
                  "description": "Three contiguous letters for the representation of currencies and funds. Valid currency codes are registered with the ISO 4217 Maintenance Agency. \n",
                  "example": "USD"
                }
              },
              "calculationDate": {
                "description": "Specifies the date and time at which the balance is calculated.",
                "DateAndTime": {
                  "example": "2022-04-17T08:00:00Z"
                }
              },
              "codes": {
                "description": "Bank defined codes to clasify balances. Possible values: BalanceCategory, BalanceType, PartyAgreementNumber.\n",
                "items": {
                  "GenericCode": {
                    "required": [
                      "name",
                      "value"
                    ],
                    "properties": {
                      "name": {
                        "description": "Name of the code in PascalCase.\n",
                        "example": "AccountingGroup"
                      },
                      "value": {
                        "description": "Code value.",
                        "example": "195"
                      },
                      "description": {
                        "Title": {
                          "example": "This is a Title."
                        }
                      }
                    },
                    "description": "Generic code definition."
                  }
                }
              }
            }
          }
        }
      }
    },
    "description": "Set of parameters used to calculate an interest cycle.\n"
  }
}