{
  "LedgerAccountBalanceResponse": {
    "required": [
      "accountId",
      "accountNumber",
      "accountType",
      "balances"
    ],
    "properties": {
      "accountId": {
        "AccountId": {
          "description": "Identification assigned by the account service institution (Servicer). Could be encoded (UUID). Also may be used as composite account identifier when overlaying the account code parts. <branch-type-subtype-number>   \n\n   \n",
          "example": "033-DDA-123456"
        }
      },
      "accountNumber": {
        "LedgerAccountNumber": {
          "description": "Ledger account number used to identify different accounts. Also used for grouping and categorizing accounts. To make it easy for readers to locate specific accounts or to know what they're looking at instantly, each account typically contains human readable codes.\n",
          "example": "1-001"
        }
      },
      "accountType": {
        "LedgerAccountType": {
          "description": "Type of the Ledger Account or Internal Bank Account. Possible values: GeneralLedger, DetailedLedger, Holding, Mirrow, Clearing, CheckDisbursed.\n",
          "example": "GeneralLedger"
        }
      },
      "balances": {
        "items": {
          "LedgerAccountBalance": {
            "required": [
              "amount",
              "balanceName"
            ],
            "properties": {
              "balanceName": {
                "LedgerBalanceName": {
                  "description": "Specifies the nature of the ledger balance. Possible Values are:  Closing, Pending, Posted, Available.\n",
                  "example": "Closing"
                }
              },
              "amount": {
                "Amount": {
                  "description": "Number of monetary units where the size of the decimal part is defined by the currency.\nNote: \ntotal number of digits: 21\nnumber of digits in fractional part: 8\nmaxInclusive: 9999999999999.99999999\nminInclusive: -9999999999999.99999999\n",
                  "example": "100"
                }
              },
              "currency": {
                "CurrencyCode": {
                  "description": "Three contiguous letters for the representation of currencies and funds. Valid currency codes are registered with the ISO 4217 Maintenance Agency. \n",
                  "example": "USD"
                }
              },
              "calculationDate": {
                "description": "Specifies the date and time at which the balance is calculated.",
                "DateAndTime": {
                  "example": "2022-04-17T08:00:00Z"
                }
              }
            },
            "description": "Numerical representation of the net increases and decreases in an account at a specific point in time.\n"
          }
        }
      }
    }
  }
}