{
  "RelatedParty": {
    "required": [
      "partyId",
      "partyRelationType"
    ],
    "properties": {
      "partyId": {
        "Id": {
          "example": "5fb9d4d6-1a3c-11ed-861d-0242ac120002"
        }
      },
      "partyType": {
        "PartyType": {
          "description": "Possible values are:\n Person,\n Organization. Also other types of servicer entities: ServicerOfficer, ExternalOrganization\n",
          "example": "Person"
        }
      },
      "partyName": {
        "readOnly": true,
        "PartyName": {
          "description": "Name by which a party is known and which is usually used to identify that party.",
          "example": "Jane Birkin"
        }
      },
      "partyRelationType": {
        "PartyRelationType": {
          "description": "Type of relation between parties.  Possible values Between Organizations and persons are: ResponsibleParty, Owner, ControlPerson, BeneficialOwner, PrimaryContact, SecondaryContact, VicePresident, President, Treasurer, Secretary, Partner. Between Persons and Organizations: Business, Organization. For Trusts: Trustor, Trustee.  Between organizations: Subsidiary, ParentOrganization, Branch. Between parties and external entities: AccountOpenningOfficer, CustomerServiceOfficer, PrimaryServicerOfficer,  SecondaryServicerOfficer, SalesPerson, ReferralOfficer. Between financial institutions: AffiliateFinancialInstitution, HoldingCompany. Between persons: Spouse, Aunt, Brother, Companion, Daugther, Father, Friend, Granddaugther, Grandmother, Grandfather, Grandson, Husband, Mother, Nephew, Niece, Sister, Son, Uncle, Wife, Child, Grandparent. Grandchild, Sibling, Parent, Partner.\n",
          "example": "PrimaryServicerOfficer"
        }
      },
      "effectiveDate": {
        "description": "Person’s relation became effective.\n",
        "DateAndTime": {
          "example": "2022-04-17T08:00:00Z"
        }
      },
      "partyRelationDescription": {
        "Description": {
          "example": "This is a description."
        }
      },
      "ownershipPercentage": {
        "description": "Company Ownership Percentage. If the relation Type is BeneficialOwner the ownership percentage could be added. Ownership means any person with more than 25% equity in the legal entity.\n",
        "PositivePercentage": {
          "description": "Value expressed as a positive percentage, rate expressed as a percentage, that is, in hundredths, for example, 0.7 is 7/10 of a percent, and 7.0 is 7%.\n    total number of digits: 11\n    number of digits in fractional part: 10\n    Max Value: 100\n",
          "example": "25"
        }
      }
    }
  }
}